# Marakulin Andrey https://github.com/Annndruha
# 2023

ans = {
    'hey': 'Привет!',
    'auth': '🔑 Авторизация',
    'conf': '📄 Конфиденциальность',
    'back': '◀️ Назад',
    'conf_full': 'Файлы, которые вы отправляете через бота будут храниться в течение нескольких месяцев на хостинге '
                 'в Москве, а также в этом чате Telegram.\nДоступ к файлам имеет узкий круг лиц, '
                 'отвественных за'
                 'работоспособность сервиса печати.\n'
                 'Мы НЕ рекомендуем использовать данный сервис для печати конфеденциальных документов!',
    'help': 'Я телеграм-бот бесплатного принтера.\n'
            'Отправьте PDF файл и получите PIN для печати.'
            'Поддерживаются только pdf файлы размером не более 3МБ.',

    'val_fail': 'Проверка не пройдена. Удостоверьтесь что вы состоите в профсоюзе и правильно ввели данные.'
                '\n\nВведите фамилию и номер профсоюзного билета в формате:\n\nИванов\n1234567',
    'val_pass': '🍻 Поздравляю! Проверка пройдена и данные сохранёны для этого телеграм-аккаунта. Можете присылать pdf.',
    'val_need': 'Для использования принтера необходимо авторизоваться.\n'
                'Отправьте фамилию и номер профсоюзного билета в формате:\n\nИванов\n1234567',
    'val_update_fail': 'Сообщение не распознано.\nЧтобы открыть инструкцию введите: /start\nДля того чтобы обновить данные авторизации введите фамилию и номер '
                       'профсоюзного билета в формате:\n\nИванов\n1234567',
    'val_update_pass': 'Поздравляю! Проверка пройдена и данные обновлены.',
    'val_addition': '\n\nНо для начала нужно авторизоваться. Нажмите на кнопку ниже:',
    'val_info': 'Вы авторизованы!\nВаш id в телеграм: <code>{}</code>\nФамилия: <code>{}</code>\nНомер профсоюзного '
                'билета: <code>{}</code>',

    'history_not_implement': 'Эта функция ещё не готова.\nТут будет история печати :)',
    'unknown_command': 'Неизвестная команда.\nУ бота лишь две команды: /start /about',
    'only_pdf': 'Документы на печать принимаются только в формате PDF',
    'doc_not_accepted': '❌ Документ не принят, сначала авторизуйтесь: ❌',

    'many_files': 'Файлов слишком много. Прикрепите только один файл pdf.',
    'file_uploaded': 'Файл <b>{}</b> получен.\nПодтвердите настройки печати:',
    'send_to_print': '✅ Файл <b>{}</b> успешно загружен. Для печати подойдите к принтеру и введите PIN:\n\n<b>{}</b>\n\n'
                     'Или <a href="https://printer.ui.profcomff.com/qr#{}">отсканируйте QR код на экране '
                     'принтера.</a>\n',

    'unknown_query': 'Видимо бот обновился, выполните команду /start',
    'im_broken': 'Глубоко внутри меня что-то сломалось...',
    'kb_error': 'Ошибка клавиатуры, что-то пошло не так',
    'download_error': 'Ошибка получения файла, попробуйте позже.',
    'bd_error': '❌ Ошибка базы данных. Попробуйте позже.',
    'print_err': '❌ Ошибка сервера печати. Попробуйте позже.'
}
